# 설계
#cat("*******************************************\n")
#cat("| 이름 | 총점 | 평균 | 등급 \n")
#cat("-------------------------------------------\n")
#cat("| name | total | avg | grade |\n")
#cat("*******************************************")
# print 해도 출력가능

## grade reaport
name<-'김유신'
kor<-80
eng<-90
math<-70
x<-c(80, 90, 70)
y<-switch(toString(mean(x)/10),
          '10'='A',
          '9'='A',
          '8'='B',
          '7'='C',
          '6'='D',
          '5'='E',
          '4'='F',
          '3'='F',
          '2'='F',
          '1'='F'
)
cat("*******************************************")
cat('|', name,'|',sum,'|', mean(x),'|', grade ,'|')
cat("*******************************************")

## stmt를 합치면 function이 된다.-> R에서는 객체를 만드는 것과 같다.
## 반드시 4가지가 있어야 한다.
grade<-function(name,kor,eng,math){

  x<-c(kor, eng, math)

  return(c(name, sum(x), mean(x), switch(toString(mean(x)/10),
                                         '10'='A',
                                         '9'='A',
                                         '8'='B',
                                         '7'='C',
                                         '6'='D',
                                         '5'='E',
                                         '4'='F',
                                         '3'='F',
                                         '2'='F',
                                         '1'='F'
  )
  ))
}
res <- grade('강감찬',60,60,60)
cat("*******************************************")
cat('|', res[1],'|',res[2],'|', res[3] ,'|', res[4] ,'|')
cat("*******************************************")
